In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('employee.csv')

In [3]:
data

   emp emp_name  salary
0    1   Ayisha   20000
1    2     arun   12000
2    3     manu    3000
3    4     achu   28000
4    5     appu   12000

In [4]:
data.shape

(5, 3)

In [5]:
data.head()

   emp emp_name  salary
0    1   Ayisha   20000
1    2     arun   12000
2    3     manu    3000
3    4     achu   28000
4    5     appu   12000

In [6]:
data.head(2)

   emp emp_name  salary
0    1   Ayisha   20000
1    2     arun   12000

In [7]:
data.tail()

   emp emp_name  salary
0    1   Ayisha   20000
1    2     arun   12000
2    3     manu    3000
3    4     achu   28000
4    5     appu   12000

In [8]:
data.tail(2)

   emp emp_name  salary
3    4     achu   28000
4    5     appu   12000

In [9]:
data['emp']

0    1
1    2
2    3
3    4
4    5
Name: emp, dtype: int64

In [10]:
data[['emp','salary']]

   emp  salary
0    1   20000
1    2   12000
2    3    3000
3    4   28000
4    5   12000

In [11]:
data.columns

Index(['emp', 'emp_name', 'salary'], dtype='object')

In [12]:
data.set_index('emp')

    emp_name  salary
emp
1     Ayisha   20000
2       arun   12000
3       manu    3000
4       achu   28000
5       appu   12000

In [15]:
data.reset_index()

   index  emp emp_name  salary
0      0    1   Ayisha   20000
1      1    2     arun   12000
2      2    3     manu    3000
3      3    4     achu   28000
4      4    5     appu   12000

In [17]:
data['emp']

0    1
1    2
2    3
3    4
4    5
Name: emp, dtype: int64

In [18]:
data[0:2]

   emp emp_name  salary
0    1   Ayisha   20000
1    2     arun   12000

In [19]:
data[['emp','salary']][0:2]

   emp  salary
0    1   20000
1    2   12000

In [20]:
data.sort_values('salary')

   emp emp_name  salary
2    3     manu    3000
1    2     arun   12000
4    5     appu   12000
0    1   Ayisha   20000
3    4     achu   28000

In [21]:
data.max()

emp             5
emp_name     manu
salary      28000
dtype: object

In [22]:
data['salary'].max()

28000

In [23]:
data.min()

emp              1
emp_name    Ayisha
salary        3000
dtype: object

In [24]:
data['emp'].min()

1

In [26]:
data.mean()

C:\Users\hp\AppData\Local\Temp\ipykernel_14160\531903386.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.mean()

emp           3.0
salary    15000.0
dtype: float64

In [27]:
data['salary'].mean()

15000.0

In [28]:
data.describe()

            emp        salary
count  5.000000      5.000000
mean   3.000000  15000.000000
std    1.581139   9433.981132
min    1.000000   3000.000000
25%    2.000000  12000.000000
50%    3.000000  12000.000000
75%    4.000000  20000.000000
max    5.000000  28000.000000

In [29]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   emp       5 non-null      int64
 1   emp_name  5 non-null      object
 2   salary    5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

# Astype

In [30]:
data.salary=data.salary.astype('float32')

In [31]:
data

   emp emp_name   salary
0    1   Ayisha  20000.0
1    2     arun  12000.0
2    3     manu   3000.0
3    4     achu  28000.0
4    5     appu  12000.0

In [32]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   emp       5 non-null      int64
 1   emp_name  5 non-null      object
 2   salary    5 non-null      float32
dtypes: float32(1), int64(1), object(1)
memory usage: 228.0+ bytes

In [33]:
data.salary=data.salary.astype('int64')

In [34]:
data

   emp emp_name  salary
0    1   Ayisha   20000
1    2     arun   12000
2    3     manu    3000
3    4     achu   28000
4    5     appu   12000

In [35]:
data[data['salary']>15000]

   emp emp_name  salary
0    1   Ayisha   20000
3    4     achu   28000

# Date as index

In [39]:
data=pd.read_csv(r'C:\Users\hp\Downloads\weather_data.csv',parse_dates=['day'])

In [40]:
data

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow
3 2017-01-04           24          7   Snow
4 2017-01-05           32          4   Rain
5 2017-01-06           31          2  Sunny

In [41]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      datetime64[ns]
 1   temperature  6 non-null      int64
 2   windspeed    6 non-null      int64
 3   event        6 non-null      object
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 320.0+ bytes

In [42]:
data.set_index('day')

            temperature  windspeed  event
day
2017-01-01           32          6   Rain
2017-01-02           35          7  Sunny
2017-01-03           28          2   Snow
2017-01-04           24          7   Snow
2017-01-05           32          4   Rain
2017-01-06           31          2  Sunny

In [43]:
pd.date_range('2022-01-01','2022-01-31')

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12',
               '2022-01-13', '2022-01-14', '2022-01-15', '2022-01-16',
               '2022-01-17', '2022-01-18', '2022-01-19', '2022-01-20',
               '2022-01-21', '2022-01-22', '2022-01-23', '2022-01-24',
               '2022-01-25', '2022-01-26', '2022-01-27', '2022-01-28',
               '2022-01-29', '2022-01-30', '2022-01-31'],
              dtype='datetime64[ns]', freq='D')

In [48]:
data=pd.read_csv('Book3.csv')

In [49]:
data

    id  name
0  1.0   anu
1  NaN  achu
2  3.0   NaN
3  4.0  arun

In [50]:
data.fillna(0)

    id  name
0  1.0   anu
1  0.0  achu
2  3.0     0
3  4.0  arun

In [51]:
data.fillna('not_provided')

             id          name
0           1.0           anu
1  not_provided          achu
2           3.0  not_provided
3           4.0          arun

In [54]:
m=data['id'].mean()
m

2.6666666666666665

In [56]:
data.fillna({'id':m,'name':'not_provided'})

         id          name
0  1.000000           anu
1  2.666667          achu
2  3.000000  not_provided
3  4.000000          arun

In [57]:
data.fillna(method='ffill')

    id  name
0  1.0   anu
1  1.0  achu
2  3.0  achu
3  4.0  arun

In [58]:
data.fillna(method='bfill')

    id  name
0  1.0   anu
1  3.0  achu
2  3.0  arun
3  4.0  arun

In [59]:
data.interpolate()

    id  name
0  1.0   anu
1  2.0  achu
2  3.0   NaN
3  4.0  arun

In [60]:
data.dropna()

    id  name
0  1.0   anu
3  4.0  arun

In [61]:
data.dropna(how='all')

    id  name
0  1.0   anu
1  NaN  achu
2  3.0   NaN
3  4.0  arun

In [62]:
data.dropna(how='any')

    id  name
0  1.0   anu
3  4.0  arun

In [ ]:
     id  name
a
b
c